#pragma once

#ifdef __cplusplus
extern "C" {
#endif

#include <stdint.h>
#define GSM7_TABLE_SIZE 127

const uint8_t gsm7_table[GSM7_TABLE_SIZE] = {
    0x00, // @ (коммерческое at)
    0x01, // £ (фунт)
    0x02, // $
    0x03, // ¥ (йена)
    0x04, // è (e с грависом)
    0x05, // é (e с акутом)
    0x06, // ù (u с грависом)
    0x07, // ì (i с грависом)
    0x08, // ò (o с грависом)
    0x09, // Ç (C с седилью)
    0x0A, // LF (перевод строки)
    0x0B, // Ø (O с косой чертой)
    0x0C, // ø (o с косой чертой)
    0x0D, // CR (возврат каретки)
    0x0E, // Å (A с кружком)
    0x0F, // å (a с кружком)
    0x10, // Δ (греческая дельта)
    0x11, // _
    0x12, // Φ (греческая фи)
    0x13, // Γ (греческая гамма)
    0x14, // Λ (греческая лямбда)
    0x15, // Ω (греческая омега)
    0x16, // Π (греческая пи)
    0x17, // Ψ (греческая пси)
    0x18, // Σ (греческая сигма)
    0x19, // Θ (греческая тета)
    0x1A, // Ξ (греческая кси)
    // 0x1B, // ESC (escape для расширенной таблицы)
    0x1C, // Æ (AE лигатура)
    0x1D, // æ (ae лигатура)
    0x1E, // ß (немецкая эсцет)
    0x1F, // É (E с акутом)
    0x20, // Пробел
    0x21, // !
    0x22, // "
    0x23, // #
    0x24, // ¤ (валюта)
    0x25, // %
    0x26, // &
    0x27, // '
    0x28, // (
    0x29, // )
    0x2A, // *
    0x2B, // +
    0x2C, // ,
    0x2D, // -
    0x2E, // .
    0x2F, // /
    0x30, // 0
    0x31, // 1
    0x32, // 2
    0x33, // 3
    0x34, // 4
    0x35, // 5
    0x36, // 6
    0x37, // 7
    0x38, // 8
    0x39, // 9
    0x3A, // :
    0x3B, // ;
    0x3C, // <
    0x3D, // =
    0x3E, // >
    0x3F, // ?
    0x40, // ¡ (перевёрнутый восклицательный)
    0x41, // A
    0x42, // B
    0x43, // C
    0x44, // D
    0x45, // E
    0x46, // F
    0x47, // G
    0x48, // H
    0x49, // I
    0x4A, // J
    0x4B, // K
    0x4C, // L
    0x4D, // M
    0x4E, // N
    0x4F, // O
    0x50, // P
    0x51, // Q
    0x52, // R
    0x53, // S
    0x54, // T
    0x55, // U
    0x56, // V
    0x57, // W
    0x58, // X
    0x59, // Y
    0x5A, // Z
    0x5B, // ä (a с умлаутом)
    0x5C, // ö (o с умлаутом)
    0x5D, // ñ (n с тильдой)
    0x5E, // ü (u с умлаутом)
    0x5F, // à (a с грависом)
    0x60, // ¿ (перевёрнутый вопросительный)
    0x61, // a
    0x62, // b
    0x63, // c
    0x64, // d
    0x65, // e
    0x66, // f
    0x67, // g
    0x68, // h
    0x69, // i
    0x6A, // j
    0x6B, // k
    0x6C, // l
    0x6D, // m
    0x6E, // n
    0x6F, // o
    0x70, // p
    0x71, // q
    0x72, // r
    0x73, // s
    0x74, // t
    0x75, // u
    0x76, // v
    0x77, // w
    0x78, // x
    0x79, // y
    0x7A, // z
    0x7B, // á (a с акутом)
    0x7C, // í (i с акутом)
    0x7D, // ó (o с акутом)
    0x7E, // ú (u с акутом)
    0x7F  // ñ (n с тильдой, дубликат)
};


#ifdef __cplusplus
}
#endif
